{
  "query": "Bible verses about anxiety",
  "timestamp": "2025-08-13T07:04:54.413Z",
  "results": [
    {
      "reference": "Philippians 4:6",
      "text": "Do not be anxious about anything, but in every situation, by prayer and petition, with thanksgiving, present your requests to God.",
      "version": "NIV",
      "reason": "Encourages believers to bring their worries to God in prayer.",
      "reflection": "Trust in God's ability to handle our anxieties and surrender them to Him in prayer."
    },
    {
      "reference": "Matthew 6:34",
      "text": "Therefore do not worry about tomorrow, for tomorrow will worry about itself. Each day has enough trouble of its own.",
      "version": "NIV",
      "reason": "Reminds us to focus on the present moment and trust God for the future.",
      "reflection": "God's grace is sufficient for each day, so we can trust Him with our future."
    },
    {
      "reference": "1 Peter 5:7",
      "text": "Cast all your anxiety on him because he cares for you.",
      "version": "NIV",
      "reason": "Emphasizes God's care and concern for His children's worries.",
      "reflection": "God's love for us motivates us to release our anxieties and burdens to Him."
    },
    {
      "reference": "Isaiah 41:10",
      "text": "So do not fear, for I am with you; do not be dismayed, for I am your God. I will strengthen you and help you; I will uphold you with my righteous right hand.",
      "version": "NIV",
      "reason": "Assures believers of God's presence, strength, and support in times of anxiety.",
      "reflection": "God's constant presence and assistance provide us with the courage to face our fears."
    },
    {
      "reference": "Psalm 55:22",
      "text": "Cast your cares on the Lord and he will sustain you; he will never let the righteous be shaken.",
      "version": "NIV",
      "reason": "Encourages surrendering worries to God and relying on His faithfulness.",
      "reflection": "Trusting in God's faithfulness enables us to find stability and peace in the midst of anxiety."
    }
  ]
}