{
  "query": "Bible verses when sick",
  "timestamp": "2025-08-13T07:05:35.998Z",
  "results": [
    {
      "reference": "Psalm 41:3",
      "text": "The Lord sustains them on their sickbed and restores them from their bed of illness.",
      "version": "NIV",
      "reason": "God's promise of sustenance and restoration in times of sickness.",
      "reflection": "Even in sickness, God is our sustainer and healer."
    },
    {
      "reference": "James 5:14-15",
      "text": "Is anyone among you sick? Let them call the elders of the church to pray over them and anoint them with oil in the name of the Lord. And the prayer offered in faith will make the sick person well; the Lord will raise them up. If they have sinned, they will be forgiven.",
      "version": "NIV",
      "reason": "Encouragement to seek prayer and healing within the community of believers.",
      "reflection": "Community prayer and faith play a role in the healing process."
    },
    {
      "reference": "Psalm 30:2",
      "text": "Lord my God, I called to you for help, and you healed me.",
      "version": "NIV",
      "reason": "A declaration of faith in God's healing power.",
      "reflection": "God is our ultimate healer when we call upon Him in times of sickness."
    },
    {
      "reference": "Isaiah 53:5",
      "text": "But he was pierced for our transgressions, he was crushed for our iniquities; the punishment that brought us peace was on him, and by his wounds we are healed.",
      "version": "NIV",
      "reason": "A reminder of Christ's sacrifice for our healing and restoration.",
      "reflection": "Through Christ's sacrifice, we find healing and peace in our sickness."
    },
    {
      "reference": "Jeremiah 17:14",
      "text": "Heal me, Lord, and I will be healed; save me and I will be saved, for you are the one I praise.",
      "version": "NIV",
      "reason": "A prayer for healing and salvation directed towards God.",
      "reflection": "Our healing and salvation come from God, the source of all praise."
    }
  ]
}