{
  "query": "Bible verses about anxiety",
  "timestamp": "2025-08-12T03:52:16.331Z",
  "results": [
    {
      "reference": "Philippians 4:6",
      "text": "Do not be anxious about anything, but in every situation, by prayer and petition, with thanksgiving, present your requests to God.",
      "version": "NIV",
      "reason": "Encourages reliance on prayer and trust in God to overcome anxiety.",
      "reflection": "Instead of worrying, bring your concerns to God in prayer."
    },
    {
      "reference": "1 Peter 5:7",
      "text": "Cast all your anxiety on him because he cares for you.",
      "version": "NIV",
      "reason": "Emphasizes the care and concern God has for His people, inviting them to release their anxieties to Him.",
      "reflection": "God's care for us is a reason to trust Him with our worries."
    },
    {
      "reference": "Matthew 6:34",
      "text": "Therefore do not be anxious about tomorrow, for tomorrow will be anxious for itself. Sufficient for the day is its own trouble.",
      "version": "ESV",
      "reason": "Reminds us to focus on the present and trust God for each day's needs.",
      "reflection": "Worrying about the future robs us of the joy of today."
    },
    {
      "reference": "Psalm 94:19",
      "text": "When anxiety was great within me, your consolation brought me joy.",
      "version": "NIV",
      "reason": "Acknowledges that God's comfort and presence can bring joy in the midst of anxiety.",
      "reflection": "Finding joy in God's presence can calm our anxious hearts."
    },
    {
      "reference": "Isaiah 41:10",
      "text": "Fear not, for I am with you; be not dismayed, for I am your God; I will strengthen you, I will help you, I will uphold you with my righteous right hand.",
      "version": "ESV",
      "reason": "Assures believers of God's presence, strength, and help in times of fear and anxiety.",
      "reflection": "God's promises of strength and support can replace our fears with faith."
    }
  ]
}