{
  "query": "Bible verses when sick",
  "timestamp": "2025-09-03T06:18:26.278Z",
  "results": [
    {
      "reference": "James 5:14-15",
      "text": "Is anyone among you sick? Let them call the elders of the church to pray over them and anoint them with oil in the name of the Lord. And the prayer offered in faith will make the sick person well; the Lord will raise them up. If they have sinned, they will be forgiven.",
      "version": "NIV",
      "reason": "This passage emphasizes the power of prayer and community support in times of illness. It suggests that seeking prayer from spiritual leaders and having faith can lead to healing and forgiveness.",
      "reflection": "In times of sickness, it is comforting to know that we are not alone. This verse encourages us to reach out to our spiritual community for support and healing. It reminds us of the importance of faith and prayer, offering hope that God listens and responds to our cries for help."
    },
    {
      "reference": "Psalm 41:3",
      "text": "The LORD sustains him on his sickbed; in his illness you restore him to full health.",
      "version": "ESV",
      "reason": "This verse reassures us of God's sustaining presence during illness. It speaks of God's ability to restore health, offering hope and encouragement to those who are suffering.",
      "reflection": "When illness strikes, it can be easy to feel abandoned and weary. This verse reminds us that God is actively sustaining us, even in our weakest moments. By trusting in His restorative power, we can find comfort and strength as we journey towards healing."
    },
    {
      "reference": "Isaiah 41:10",
      "text": "So do not fear, for I am with you; do not be dismayed, for I am your God. I will strengthen you and help you; I will uphold you with my righteous right hand.",
      "version": "NIV",
      "reason": "This verse provides reassurance of God's presence and strength in times of trouble, including sickness. It encourages the sick not to fear, emphasizing God's willingness to help and uphold them.",
      "reflection": "Fear and anxiety can be overwhelming when facing illness, but this verse reminds us of God's unwavering presence. By focusing on His promise to strengthen and support us, we can find peace and courage to face each day, trusting that we are in His capable hands."
    },
    {
      "reference": "3 John 1:2",
      "text": "Dear friend, I pray that you may enjoy good health and that all may go well with you, even as your soul is getting along well.",
      "version": "NIV",
      "reason": "This verse expresses a heartfelt desire for physical health and overall well-being. It highlights the importance of holistic health, linking physical wellness with spiritual prosperity.",
      "reflection": "This prayerful wish for good health reminds us that God cares about our physical and spiritual well-being. As we seek healing, it's important to nurture our spiritual health, knowing that a thriving soul can impact our overall wellness. May we strive for balance and seek God's guidance in all areas of our lives."
    },
    {
      "reference": "Matthew 11:28",
      "text": "Come to me, all you who are weary and burdened, and I will give you rest.",
      "version": "NIV",
      "reason": "This invitation from Jesus offers solace to those who are weary from illness. It promises rest and relief from burdens, encouraging the sick to seek comfort in Christ.",
      "reflection": "Sickness often brings physical and emotional exhaustion. In these moments, Jesus' invitation is a soothing balm, offering rest and peace. By bringing our burdens to Him, we can find solace and rejuvenation, trusting in His promise to refresh our weary souls."
    }
  ]
}