{
  "query": "Bible verses about the collapse of human consciousness",
  "timestamp": "2025-08-13T07:29:04.102Z",
  "results": [
    {
      "reference": "Romans 1:21",
      "text": "For although they knew God, they neither glorified him as God nor gave thanks to him, but their thinking became futile and their foolish hearts were darkened.",
      "version": "NIV",
      "reason": "Describes the consequences of turning away from God and the decline of human understanding.",
      "reflection": "When we fail to acknowledge God, our minds can become clouded and our hearts hardened."
    },
    {
      "reference": "Ephesians 4:18",
      "text": "They are darkened in their understanding, alienated from the life of God because of the ignorance that is in them, due to their hardness of heart.",
      "version": "ESV",
      "reason": "Highlights the separation from God leading to a lack of understanding and ignorance.",
      "reflection": "Without a connection to God, our hearts can become hardened and our understanding darkened."
    },
    {
      "reference": "2 Corinthians 4:4",
      "text": "The god of this age has blinded the minds of unbelievers, so that they cannot see the light of the gospel that displays the glory of Christ, who is the image of God.",
      "version": "NIV",
      "reason": "Illustrates how the mindset of the world can blind people to the truth of Christ.",
      "reflection": "The distractions of the world can prevent us from seeing the truth and glory of Christ."
    },
    {
      "reference": "Isaiah 44:18",
      "text": "They know nothing, they understand nothing; their eyes are plastered over so they cannot see, and their minds closed so they cannot understand.",
      "version": "NIV",
      "reason": "Portrays a state of spiritual blindness and lack of understanding.",
      "reflection": "When we are spiritually blind, we are unable to perceive the truths that God wants to reveal to us."
    },
    {
      "reference": "Proverbs 28:5",
      "text": "Evil men do not understand justice, but those who seek the Lord understand it fully.",
      "version": "NIV",
      "reason": "Shows the contrast between those who reject God and those who seek Him in understanding justice.",
      "reflection": "True understanding of justice comes from seeking the Lord and aligning our hearts with His righteousness."
    }
  ]
}