{
  "query": "Bible verses about healing",
  "timestamp": "2025-08-12T04:27:42.553Z",
  "results": [
    {
      "reference": "James 5:15",
      "text": "And the prayer offered in faith will make the sick person well; the Lord will raise them up. If they have sinned, they will be forgiven.",
      "version": "NIV",
      "reason": "Emphasizes the power of prayer and faith in bringing about healing.",
      "reflection": "Believing in the power of prayer can bring healing and forgiveness."
    },
    {
      "reference": "Psalm 103:2-3",
      "text": "Praise the Lord, my soul, and forget not all his benefits—who forgives all your sins and heals all your diseases.",
      "version": "NIV",
      "reason": "Connects healing with the forgiveness of sins and God's benefits.",
      "reflection": "God is the ultimate healer who forgives sins and heals diseases."
    },
    {
      "reference": "Isaiah 53:5",
      "text": "But he was pierced for our transgressions, he was crushed for our iniquities; the punishment that brought us peace was on him, and by his wounds we are healed.",
      "version": "NIV",
      "reason": "Points to the atoning sacrifice of Jesus as bringing spiritual and physical healing.",
      "reflection": "Through Jesus' sacrifice, we find healing and peace."
    },
    {
      "reference": "Matthew 4:23",
      "text": "Jesus went throughout Galilee, teaching in their synagogues, proclaiming the good news of the kingdom, and healing every disease and sickness among the people.",
      "version": "NIV",
      "reason": "Illustrates Jesus' ministry of physical healing as an expression of the kingdom of God.",
      "reflection": "Jesus' healing miracles reveal the power and compassion of God's kingdom."
    },
    {
      "reference": "Jeremiah 17:14",
      "text": "Heal me, Lord, and I will be healed; save me and I will be saved, for you are the one I praise.",
      "version": "NIV",
      "reason": "A prayer for healing and salvation, acknowledging God as the source of both.",
      "reflection": "Turning to God in prayer for healing and salvation brings praise to Him."
    }
  ]
}