{
  "query": "blasphemy",
  "timestamp": "2025-08-12T03:47:44.073Z",
  "results": [
    {
      "reference": "Matthew 12:31",
      "text": "And so I tell you, every kind of sin and slander can be forgiven, but blasphemy against the Spirit will not be forgiven.",
      "version": "NIV",
      "reason": "Jesus emphasizes the seriousness of blasphemy against the Holy Spirit.",
      "reflection": "Let us be careful with our words and attitudes towards the work of the Holy Spirit."
    },
    {
      "reference": "Mark 3:29",
      "text": "but whoever blasphemes against the Holy Spirit never has forgiveness, but is guilty of an eternal sin",
      "version": "ESV",
      "reason": "Jesus warns about the eternal consequences of blaspheming the Holy Spirit.",
      "reflection": "May we always honor and respect the work of the Holy Spirit in our lives."
    },
    {
      "reference": "Leviticus 24:16",
      "text": "Whoever blasphemes the name of the Lord shall surely be put to death. All the congregation shall stone him. The sojourner as well as the native, when he blasphemes the Name, shall be put to death.",
      "version": "ESV",
      "reason": "Old Testament law commands severe punishment for blasphemy against the Lord.",
      "reflection": "While the consequences may not be immediate, disrespecting God's name carries serious weight."
    },
    {
      "reference": "1 Timothy 1:13",
      "text": "though formerly I was a blasphemer, persecutor, and insolent opponent. But I received mercy because I had acted ignorantly in unbelief.",
      "version": "ESV",
      "reason": "Paul acknowledges his past as a blasphemer before receiving mercy.",
      "reflection": "God's mercy is available even to those who have spoken against Him, showing His abundant grace."
    },
    {
      "reference": "Acts 6:11",
      "text": "Then they secretly instigated men who said, 'We have heard him speak blasphemous words against Moses and God.'",
      "version": "ESV",
      "reason": "Accusations of blasphemy were used to incite opposition against Stephen.",
      "reflection": "In times of opposition, may we stand firm in our faith and trust in God's sovereignty."
    }
  ]
}