{
  "query": "Bible verses about healing",
  "timestamp": "2025-08-13T07:05:10.542Z",
  "results": [
    {
      "reference": "James 5:15",
      "text": "And the prayer offered in faith will make the sick person well; the Lord will raise them up. If they have sinned, they will be forgiven.",
      "version": "NIV",
      "reason": "Shows the power of prayer and faith in healing.",
      "reflection": "Healing is not only physical but also spiritual, bringing restoration and forgiveness."
    },
    {
      "reference": "Jeremiah 17:14",
      "text": "Heal me, Lord, and I will be healed; save me and I will be saved, for you are the one I praise.",
      "version": "NIV",
      "reason": "A plea for healing directly to the Lord.",
      "reflection": "Our ultimate healing and salvation come from God alone, and we can find true praise in His restoration."
    },
    {
      "reference": "Isaiah 53:5",
      "text": "But he was pierced for our transgressions, he was crushed for our iniquities; the punishment that brought us peace was on him, and by his wounds we are healed.",
      "version": "NIV",
      "reason": "Points to the ultimate healing through Jesus' sacrifice.",
      "reflection": "The greatest healing we can receive is through the wounds of Christ, bringing us peace and restoration."
    },
    {
      "reference": "Psalm 103:2-3",
      "text": "Praise the Lord, my soul, and forget not all his benefits— who forgives all your sins and heals all your diseases.",
      "version": "NIV",
      "reason": "Connects forgiveness of sins with healing of diseases.",
      "reflection": "God's healing encompasses both physical and spiritual restoration, showing His complete care for us."
    },
    {
      "reference": "Matthew 4:23",
      "text": "Jesus went throughout Galilee, teaching in their synagogues, proclaiming the good news of the kingdom, and healing every disease and sickness among the people.",
      "version": "NIV",
      "reason": "Demonstrates Jesus' power and compassion in healing.",
      "reflection": "Just as Jesus healed the sick during His ministry, He is still able and willing to bring healing to us today."
    }
  ]
}