{
  "query": "“Their flesh shall rot while they are still on their feet; their eyes shall rot in their sockets, and their tongues shall rot in their mouths.”",
  "timestamp": "2025-10-13T03:33:18.340Z",
  "results": [
    {
      "reference": "Zechariah 14:12",
      "text": "And this shall be the plague with which the LORD will strike all the peoples that wage war against Jerusalem: their flesh will rot while they are still standing on their feet, their eyes will rot in their sockets, and their tongues will rot in their mouths.",
      "reason": "This verse directly mirrors the prompt, describing a divine plague as a judgment from God against nations that oppose Jerusalem. It serves as a warning of the consequences of standing against God's people and plans.",
      "reflection": "Reflecting on this verse, we are reminded of the seriousness of opposing God's purposes. It challenges us to align our lives with God's will and to seek peace rather than conflict. In our daily lives, we should strive to live in harmony with God's plans, seeking His guidance and wisdom to lead us in paths of righteousness and peace."
    },
    {
      "reference": "Deuteronomy 28:22",
      "text": "The LORD will strike you with wasting disease, with fever and inflammation, with scorching heat and drought, with blight and mildew, which will plague you until you perish.",
      "reason": "This verse speaks of curses that befall those who disobey God's commandments, similar to the judgment described in the prompt. It emphasizes the physical decay and suffering as a consequence of turning away from God's laws.",
      "reflection": "This verse serves as a somber reminder of the importance of obedience to God. It encourages us to remain faithful and to heed God's commandments. In our daily lives, we can use this reflection to commit to living in accordance with God's word, seeking His favor and protection by walking in His ways."
    },
    {
      "reference": "Isaiah 34:2-3",
      "text": "For the LORD is enraged against all the nations, and furious against all their host; he has devoted them to destruction, has given them over for slaughter. Their slain shall be cast out, and the stench of their corpses shall rise; the mountains shall flow with their blood.",
      "reason": "This passage describes God's wrath against nations that rebel against Him, paralleling the theme of divine judgment found in the prompt. It highlights the severity and totality of God's judgment.",
      "reflection": "In contemplating this passage, we are reminded of the power and righteousness of God's judgment. It challenges us to live in a way that is pleasing to God, avoiding paths that lead to His wrath. By choosing to follow God's commandments and live in His love, we can find security and hope amidst the chaos of the world."
    },
    {
      "reference": "Revelation 16:10-11",
      "text": "The fifth angel poured out his bowl on the throne of the beast, and its kingdom was plunged into darkness. People gnawed their tongues in anguish and cursed the God of heaven for their pain and sores. They did not repent of their deeds.",
      "reason": "This verse describes a judgment upon the kingdom of the beast, where pain and suffering are inflicted as a consequence of disbelief and sin. It resonates with the theme of divine retribution described in the prompt.",
      "reflection": "Reflecting on this verse, we see the futility of resisting God's will. It encourages us to repent and seek God earnestly, rather than hardening our hearts in times of trouble. In our everyday lives, we should strive to maintain a repentant heart, turning to God in times of distress, and trusting in His mercy and grace."
    },
    {
      "reference": "Job 18:13-14",
      "text": "It consumes the parts of his skin; the firstborn of death consumes his limbs. He is torn from the tent in which he trusted and is brought to the king of terrors.",
      "reason": "This passage speaks of the destruction of the wicked, symbolizing death and decay similar to the imagery in the prompt. It illustrates the ultimate fate of those who trust in earthly things rather than God.",
      "reflection": "This verse reminds us of the impermanence of earthly security and the importance of placing our trust in God. It challenges us to examine our own lives and consider where we have placed our trust. By focusing on God as our ultimate refuge, we can find peace and assurance even in the face of life's uncertainties and trials."
    }
  ]
}