{
  "query": "the disciple who jesus loved",
  "timestamp": "2025-08-12T15:11:55.097Z",
  "results": [
    {
      "reference": "John 13:23",
      "text": "One of them, the disciple whom Jesus loved, was reclining next to him.",
      "version": "NIV",
      "reason": "This verse specifically mentions the disciple whom Jesus loved.",
      "reflection": "Jesus's love for each of His disciples is personal and intimate."
    },
    {
      "reference": "John 19:26",
      "text": "When Jesus saw his mother there, and the disciple whom he loved standing nearby, he said to her, “Woman, here is your son,”",
      "version": "NIV",
      "reason": "Shows the special relationship between Jesus and the disciple He loved.",
      "reflection": "Jesus entrusts those He loves to care for one another."
    },
    {
      "reference": "John 21:20",
      "text": "Peter turned and saw that the disciple whom Jesus loved was following them. (This was the one who had leaned back against Jesus at the supper and had said, “Lord, who is going to betray you?”)",
      "version": "NIV",
      "reason": "Another reference to the disciple whom Jesus loved in the Gospel of John.",
      "reflection": "Being loved by Jesus does not exempt us from following Him."
    },
    {
      "reference": "John 21:24",
      "text": "This is the disciple who testifies to these things and who wrote them down. We know that his testimony is true.",
      "version": "NIV",
      "reason": "Confirms the authorship of the Gospel of John by the disciple whom Jesus loved.",
      "reflection": "Those who are loved by Jesus are entrusted with sharing His truth."
    },
    {
      "reference": "1 John 4:16",
      "text": "And so we know and rely on the love God has for us. God is love. Whoever lives in love lives in God, and God in them.",
      "version": "NIV",
      "reason": "Highlights the importance of knowing and relying on God's love.",
      "reflection": "As the disciple whom Jesus loved, we are called to abide in God's love and reflect it to others."
    }
  ]
}