{
  "query": "you",
  "timestamp": "2025-08-08T06:41:40.631Z",
  "results": [
    {
      "reference": "Jeremiah 29:11",
      "text": "For I know the plans I have for you, declares the Lord, plans to prosper you and not to harm you, plans to give you hope and a future.",
      "version": "NIV",
      "reason": "This verse speaks directly to God's personal plans and intentions for each individual, offering reassurance.",
      "reflection": "Trust in God's plan for your life, as He desires your well-being and a hopeful future."
    },
    {
      "reference": "Isaiah 41:10",
      "text": "So do not fear, for I am with you; do not be dismayed, for I am your God. I will strengthen you and help you; I will uphold you with my righteous right hand.",
      "version": "NIV",
      "reason": "This verse emphasizes God's presence with you, providing strength and support.",
      "reflection": "Rely on God's strength and presence to overcome fear and anxiety."
    },
    {
      "reference": "Philippians 4:13",
      "text": "I can do all things through him who strengthens me.",
      "version": "ESV",
      "reason": "This verse highlights the empowerment you receive through Christ, enabling you to face challenges.",
      "reflection": "With Christ's strength, you can tackle any obstacle that comes your way."
    },
    {
      "reference": "Matthew 11:28",
      "text": "Come to me, all who labor and are heavy laden, and I will give you rest.",
      "version": "ESV",
      "reason": "Jesus invites you to find rest and relief from burdens in Him, offering peace and comfort.",
      "reflection": "Seek rest in Jesus when you feel overwhelmed by life's burdens."
    },
    {
      "reference": "Psalm 23:1",
      "text": "The Lord is my shepherd, I lack nothing.",
      "version": "NIV",
      "reason": "This verse portrays a personal relationship with God, assuring you of His provision and care.",
      "reflection": "With God as your shepherd, trust that you have all you need."
    }
  ]
}