{
  "query": "trust in me weak of faith",
  "timestamp": "2025-08-12T03:52:35.592Z",
  "results": [
    {
      "reference": "Matthew 8:26",
      "text": "He replied, 'You of little faith, why are you so afraid?' Then he got up and rebuked the winds and the waves, and it was completely calm.",
      "version": "NIV",
      "reason": "Jesus addressing the disciples' lack of faith during a storm.",
      "reflection": "When our faith is weak, we tend to be overcome by fear, but Jesus can calm any storm in our lives."
    },
    {
      "reference": "Matthew 14:31",
      "text": "Immediately Jesus reached out his hand and caught him. 'You of little faith,' he said, 'why did you doubt?'",
      "version": "NIV",
      "reason": "Jesus rescuing Peter when his faith wavered while walking on water.",
      "reflection": "Even in moments of doubt, Jesus is always there to rescue us when we call out to Him."
    },
    {
      "reference": "Mark 4:40",
      "text": "He said to his disciples, 'Why are you so afraid? Do you still have no faith?'",
      "version": "NIV",
      "reason": "Jesus questioning the disciples' fear and lack of faith during a storm.",
      "reflection": "Fear and faith cannot coexist; choose to trust in Jesus even in the midst of life's storms."
    },
    {
      "reference": "Romans 14:1",
      "text": "As for the one who is weak in faith, welcome him, but not to quarrel over opinions.",
      "version": "ESV",
      "reason": "Encouragement to accept those with weak faith without judgment or argument.",
      "reflection": "We should show love and acceptance to those whose faith is struggling, just as Christ welcomes us."
    },
    {
      "reference": "James 1:6",
      "text": "But let him ask in faith, with no doubting, for the one who doubts is like a wave of the sea that is driven and tossed by the wind.",
      "version": "ESV",
      "reason": "Emphasis on the importance of asking God in faith without doubt.",
      "reflection": "Doubt can lead to instability in our spiritual walk; trusting God wholeheartedly brings peace and direction."
    }
  ]
}