{
  "query": "blasphemy",
  "timestamp": "2025-08-12T03:47:41.919Z",
  "results": [
    {
      "reference": "Matthew 12:31-32",
      "text": "And so I tell you, every kind of sin and slander can be forgiven, but blasphemy against the Spirit will not be forgiven. Anyone who speaks a word against the Son of Man will be forgiven, but anyone who speaks against the Holy Spirit will not be forgiven, either in this age or in the age to come.",
      "version": "NIV",
      "reason": "Jesus' teaching on the seriousness of blasphemy against the Holy Spirit.",
      "reflection": "Let us be cautious with our words and always honor the work of the Holy Spirit in our lives."
    },
    {
      "reference": "Leviticus 24:16",
      "text": "Whoever blasphemes the name of the Lord shall surely be put to death. All the congregation shall stone him. The sojourner as well as the native, when he blasphemes the Name, shall be put to death.",
      "version": "ESV",
      "reason": "Old Testament law regarding blasphemy against the name of the Lord.",
      "reflection": "God's name is to be revered and not blasphemed, showing the seriousness of honoring Him."
    },
    {
      "reference": "Mark 3:28-29",
      "text": "Truly, I say to you, all sins will be forgiven the children of man, and whatever blasphemies they utter, but whoever blasphemes against the Holy Spirit never has forgiveness, but is guilty of an eternal sin.",
      "version": "ESV",
      "reason": "Jesus' warning about the eternal consequences of blaspheming the Holy Spirit.",
      "reflection": "Let us seek forgiveness and guard our hearts against speaking against the Spirit's work."
    },
    {
      "reference": "1 Timothy 1:13",
      "text": "though formerly I was a blasphemer, persecutor, and insolent opponent. But I received mercy because I had acted ignorantly in unbelief.",
      "version": "ESV",
      "reason": "Paul acknowledging his past as a blasphemer before receiving mercy and grace.",
      "reflection": "God's mercy is available even to those who have spoken against Him, showing the depth of His love and forgiveness."
    },
    {
      "reference": "Jude 1:8-10",
      "text": "Yet in like manner these people also, relying on their dreams, defile the flesh, reject authority, and blaspheme the glorious ones. But when the archangel Michael, contending with the devil, was disputing about the body of Moses, he did not presume to pronounce a blasphemous judgment, but said, 'The Lord rebuke you.'",
      "version": "ESV",
      "reason": "Warning against blaspheming spiritual authorities and the importance of showing respect.",
      "reflection": "Let us guard our speech and show respect even in spiritual disagreements, following the example of the archangel Michael."
    }
  ]
}