{
  "query": "When will Jesus return?",
  "timestamp": "2025-08-12T04:15:35.952Z",
  "results": [
    {
      "reference": "Matthew 24:36",
      "text": "But about that day or hour no one knows, not even the angels in heaven, nor the Son, but only the Father.",
      "version": "NIV",
      "reason": "Emphasizes the unknown timing of Jesus' return.",
      "reflection": "Our focus should be on being ready for His return rather than speculating about the timing."
    },
    {
      "reference": "Matthew 24:42",
      "text": "Therefore keep watch, because you do not know on what day your Lord will come.",
      "version": "NIV",
      "reason": "Encourages readiness and vigilance for Jesus' return.",
      "reflection": "Living in constant awareness of His imminent return helps us stay faithful and prepared."
    },
    {
      "reference": "1 Thessalonians 5:2",
      "text": "For you know very well that the day of the Lord will come like a thief in the night.",
      "version": "NIV",
      "reason": "Compares Jesus' return to a thief coming unexpectedly.",
      "reflection": "Just as we wouldn't want a thief to catch us off guard, let's be spiritually watchful for Christ's return."
    },
    {
      "reference": "Revelation 22:20",
      "text": "He who testifies to these things says, 'Yes, I am coming soon.' Amen. Come, Lord Jesus.",
      "version": "NIV",
      "reason": "Affirms the promise of Jesus' imminent return.",
      "reflection": "Our response should be a heartfelt desire for His return, eagerly awaiting His coming."
    },
    {
      "reference": "2 Peter 3:10",
      "text": "But the day of the Lord will come like a thief. The heavens will disappear with a roar; the elements will be destroyed by fire, and the earth and everything done in it will be laid bare.",
      "version": "NIV",
      "reason": "Describes the dramatic events surrounding Jesus' return.",
      "reflection": "Let this reality motivate us to live holy and godly lives, knowing the temporary nature of this world."
    }
  ]
}