{
  "query": "Bible verses when sick",
  "timestamp": "2025-08-12T03:58:15.264Z",
  "results": [
    {
      "reference": "James 5:14-15",
      "text": "Is anyone among you sick? Let them call the elders of the church to pray over them and anoint them with oil in the name of the Lord. And the prayer offered in faith will make the sick person well; the Lord will raise them up. If they have sinned, they will be forgiven.",
      "version": "NIV",
      "reason": "Offers guidance on seeking prayer and healing when sick.",
      "reflection": "Seeking prayer and anointing for healing shows faith in God's power."
    },
    {
      "reference": "Psalm 41:3",
      "text": "The Lord sustains them on their sickbed and restores them from their bed of illness.",
      "version": "NIV",
      "reason": "Emphasizes God's ability to sustain and restore the sick.",
      "reflection": "God is our sustainer and healer even in times of sickness."
    },
    {
      "reference": "Proverbs 17:22",
      "text": "A cheerful heart is good medicine, but a crushed spirit dries up the bones.",
      "version": "NIV",
      "reason": "Highlights the importance of a positive attitude for healing.",
      "reflection": "Maintaining joy and positivity can aid in the healing process."
    },
    {
      "reference": "Psalm 30:2",
      "text": "Lord my God, I called to you for help, and you healed me.",
      "version": "NIV",
      "reason": "Acknowledges God as the ultimate healer in times of need.",
      "reflection": "God's healing power is accessible through prayer and faith."
    },
    {
      "reference": "Isaiah 53:5",
      "text": "But he was pierced for our transgressions, he was crushed for our iniquities; the punishment that brought us peace was on him, and by his wounds we are healed.",
      "version": "NIV",
      "reason": "Points to the ultimate healing through Christ's sacrifice.",
      "reflection": "In Christ's sacrifice, we find ultimate healing for our sins and our bodies."
    }
  ]
}