{
  "query": "hope and healing",
  "timestamp": "2025-08-08T23:34:48.448Z",
  "results": [
    {
      "reference": "Jeremiah 29:11",
      "text": "For I know the plans I have for you, declares the Lord, plans for welfare and not for evil, to give you a future and a hope.",
      "version": "ESV",
      "reason": "This verse assures us of God's good plans for our future, instilling hope.",
      "reflection": "Trust in God's plans brings healing to our anxious hearts."
    },
    {
      "reference": "Psalm 147:3",
      "text": "He heals the brokenhearted and binds up their wounds.",
      "version": "NIV",
      "reason": "This verse speaks directly to God's healing nature for those who are heartbroken.",
      "reflection": "God's compassionate care offers hope and restoration."
    },
    {
      "reference": "Isaiah 40:31",
      "text": "But those who hope in the Lord will renew their strength. They will soar on wings like eagles; they will run and not grow weary, they will walk and not be faint.",
      "version": "NIV",
      "reason": "Hope in the Lord is linked with renewed strength and endurance.",
      "reflection": "Hope fuels our healing journey, lifting us above life's challenges."
    },
    {
      "reference": "Romans 15:13",
      "text": "May the God of hope fill you with all joy and peace as you trust in him, so that you may overflow with hope by the power of the Holy Spirit.",
      "version": "NIV",
      "reason": "This verse centers on God as a source of hope, joy, and peace.",
      "reflection": "Holy Spirit-filled hope brings profound healing and peace."
    },
    {
      "reference": "1 Peter 5:10",
      "text": "And after you have suffered a little while, the God of all grace, who has called you to his eternal glory in Christ, will himself restore, confirm, strengthen, and establish you.",
      "version": "ESV",
      "reason": "This verse promises God's restoration and strength after suffering.",
      "reflection": "God's grace assures ultimate healing and restoration."
    }
  ]
}