{
  "query": "What is the rapture?",
  "timestamp": "2025-08-14T02:38:35.221Z",
  "results": [
    {
      "reference": "1 Thessalonians 4:16-17",
      "text": "For the Lord himself will come down from heaven, with a loud command, with the voice of the archangel and with the trumpet call of God, and the dead in Christ will rise first. After that, we who are still alive and are left will be caught up together with them in the clouds to meet the Lord in the air. And so we will be with the Lord forever.",
      "version": "NIV",
      "reason": "Describes the event of believers being caught up to meet the Lord in the air.",
      "reflection": "The rapture is the blessed hope for believers to be united with the Lord forever."
    },
    {
      "reference": "1 Corinthians 15:51-52",
      "text": "Listen, I tell you a mystery: We will not all sleep, but we will all be changed— in a flash, in the twinkling of an eye, at the last trumpet. For the trumpet will sound, the dead will be raised imperishable, and we will be changed.",
      "version": "NIV",
      "reason": "Speaks of the transformation of believers at the moment of the rapture.",
      "reflection": "At the rapture, believers will be transformed and receive imperishable bodies."
    },
    {
      "reference": "Matthew 24:30-31",
      "text": "Then will appear the sign of the Son of Man in heaven. And then all the peoples of the earth will mourn when they see the Son of Man coming on the clouds of heaven, with power and great glory. And he will send his angels with a loud trumpet call, and they will gather his elect from the four winds, from one end of the heavens to the other.",
      "version": "NIV",
      "reason": "Describes the gathering of God's elect by angels at the return of Jesus.",
      "reflection": "The rapture involves the gathering of God's chosen ones by His angels at the return of Jesus."
    },
    {
      "reference": "John 14:3",
      "text": "And if I go and prepare a place for you, I will come back and take you to be with me that you also may be where I am.",
      "version": "NIV",
      "reason": "Jesus promises to come back and take believers to be with Him.",
      "reflection": "The rapture fulfills Jesus' promise to come back and take believers to be with Him."
    },
    {
      "reference": "Revelation 3:10",
      "text": "Since you have kept my command to endure patiently, I will also keep you from the hour of trial that is going to come on the whole world to test the inhabitants of the earth.",
      "version": "NIV",
      "reason": "Speaks of believers being kept from a future trial or tribulation.",
      "reflection": "The rapture is a means by which believers are kept from the time of great tribulation on the earth."
    }
  ]
}