{
  "query": "why did jesus cry",
  "timestamp": "2025-08-09T00:09:44.909Z",
  "results": [
    {
      "reference": "John 11:35",
      "text": "Jesus wept.",
      "version": "NIV",
      "reason": "This verse is the shortest in the Bible but deeply significant. Jesus wept over the death of His friend Lazarus, showing His deep compassion and empathy for human suffering.",
      "reflection": "Jesus shares in our grief and sorrows, reminding us that He is close to the brokenhearted."
    },
    {
      "reference": "Luke 19:41",
      "text": "As he approached Jerusalem and saw the city, he wept over it.",
      "version": "NIV",
      "reason": "Jesus wept over Jerusalem because of its people's spiritual blindness and the impending judgment they faced. His tears show His deep love and concern for humanity's spiritual state.",
      "reflection": "Jesus longs for us to recognize His presence and receive His peace."
    },
    {
      "reference": "Hebrews 5:7",
      "text": "During the days of Jesus' life on earth, he offered up prayers and petitions with fervent cries and tears to the one who could save him from death, and he was heard because of his reverent submission.",
      "version": "NIV",
      "reason": "This verse highlights Jesus' humanity and His earnest prayers to God, revealing His deep emotional connection and dependence on the Father.",
      "reflection": "Even in our deepest anguish, we can turn to God with confidence, knowing that He hears us."
    },
    {
      "reference": "Matthew 26:38",
      "text": "Then he said to them, 'My soul is overwhelmed with sorrow to the point of death. Stay here and keep watch with me.'",
      "version": "NIV",
      "reason": "Jesus expressed profound sorrow in the Garden of Gethsemane, illustrating His inner turmoil and the weight of what He was about to endure for humanity's redemption.",
      "reflection": "In moments of deep distress, we are invited to share our burdens with God and others."
    },
    {
      "reference": "Isaiah 53:3",
      "text": "He was despised and rejected by mankind, a man of suffering, and familiar with pain. Like one from whom people hide their faces he was despised, and we held him in low esteem.",
      "version": "NIV",
      "reason": "This prophetic description of Jesus captures His experience of rejection and suffering, which moved Him to tears for humanity's condition.",
      "reflection": "Jesus' willingness to suffer for us demonstrates His immense love and understanding of our pain."
    }
  ]
}