{
  "query": "What are the most outrageous Bible verses ?",
  "timestamp": "2025-08-09T06:34:22.524Z",
  "results": [
    {
      "reference": "2 Kings 2:23-24",
      "text": "From there Elisha went up to Bethel. As he was walking along the road, some boys came out of the town and jeered at him. 'Get out of here, baldy!' they said. 'Get out of here, baldy!' He turned around, looked at them and called down a curse on them in the name of the Lord. Then two bears came out of the woods and mauled forty-two of the boys.",
      "version": "NIV",
      "reason": "The unexpected and severe consequence of mocking a prophet highlights the seriousness of respecting God's messengers.",
      "reflection": "Respect for divine authority is essential; our actions have consequences."
    },
    {
      "reference": "Ezekiel 4:12",
      "text": "Eat the food as you would a loaf of barley bread; bake it in the sight of the people, using human excrement for fuel.",
      "version": "NIV",
      "reason": "This verse describes a shocking prophetic act symbolizing the defilement Israel would experience during exile.",
      "reflection": "God sometimes uses shocking imagery to convey the depth of spiritual truths."
    },
    {
      "reference": "Judges 19:29",
      "text": "When he reached home, he took a knife and cut up his concubine, limb by limb, into twelve parts and sent them into all the areas of Israel.",
      "version": "NIV",
      "reason": "This gruesome act was intended to unite Israel against a grave injustice, highlighting the societal chaos without a king.",
      "reflection": "The absence of righteousness leads to moral and societal decay."
    },
    {
      "reference": "Genesis 38:8-10",
      "text": "Then Judah said to Onan, 'Sleep with your brother’s wife and fulfill your duty to her as a brother-in-law to raise up offspring for your brother.' But Onan knew that the child would not be his; so whenever he slept with his brother’s wife, he spilled his semen on the ground to keep from providing offspring for his brother. What he did was wicked in the Lord’s sight; so the Lord put him to death also.",
      "version": "NIV",
      "reason": "Onan's actions and the subsequent divine judgment seem severe, reflecting the importance of duty and righteousness.",
      "reflection": "God values integrity and commitment to one's responsibilities."
    },
    {
      "reference": "Acts 5:1-5",
      "text": "Now a man named Ananias, together with his wife Sapphira, also sold a piece of property. With his wife’s full knowledge he kept back part of the money for himself, but brought the rest and put it at the apostles’ feet. Then Peter said, 'Ananias, how is it that Satan has so filled your heart that you have lied to the Holy Spirit and have kept for yourself some of the money you received for the land? Didn’t it belong to you before it was sold? And after it was sold, wasn’t the money at your disposal? What made you think of doing such a thing? You have not lied just to human beings but to God.' When Ananias heard this, he fell down and died. And great fear seized all who heard what had happened.",
      "version": "NIV",
      "reason": "This verse underscores the seriousness of honesty within the early church and the consequences of deceit.",
      "reflection": "Honesty and integrity before God are non-negotiable values."
    }
  ]
}