{
  "query": "peace",
  "timestamp": "2025-08-12T04:17:51.971Z",
  "results": [
    {
      "reference": "Psalm 29:11",
      "text": "The Lord gives strength to his people; the Lord blesses his people with peace.",
      "version": "NIV",
      "reason": "God's blessing of peace to His people.",
      "reflection": "In times of weakness, God provides us with His strength and peace."
    },
    {
      "reference": "John 14:27",
      "text": "Peace I leave with you; my peace I give you. I do not give to you as the world gives. Do not let your hearts be troubled and do not be afraid.",
      "version": "NIV",
      "reason": "Jesus' gift of peace to His disciples.",
      "reflection": "The peace Jesus offers surpasses all understanding and calms our troubled hearts."
    },
    {
      "reference": "Philippians 4:6-7",
      "text": "Do not be anxious about anything, but in every situation, by prayer and petition, with thanksgiving, present your requests to God. And the peace of God, which transcends all understanding, will guard your hearts and your minds in Christ Jesus.",
      "version": "NIV",
      "reason": "Finding peace through prayer and thanksgiving.",
      "reflection": "Instead of worrying, let's bring our concerns to God in prayer and experience His peace that surpasses all understanding."
    },
    {
      "reference": "Isaiah 26:3",
      "text": "You keep him in perfect peace whose mind is stayed on you, because he trusts in you.",
      "version": "ESV",
      "reason": "Peace through trust and focus on God.",
      "reflection": "Our peace is found in trusting and fixing our thoughts on God."
    },
    {
      "reference": "Romans 15:13",
      "text": "May the God of hope fill you with all joy and peace in believing, so that by the power of the Holy Spirit you may abound in hope.",
      "version": "ESV",
      "reason": "Finding joy, peace, and hope through belief in God.",
      "reflection": "God fills us with joy and peace as we trust in Him, leading to hope through the Holy Spirit."
    }
  ]
}