{
  "query": "Bible verses about healing",
  "timestamp": "2025-08-12T02:54:33.737Z",
  "results": [
    {
      "reference": "Psalms 10:14",
      "text": "But you, O God, do see trouble and grief; you consider it to take it in hand. The victim commits himself to you; you are the helper of the fatherless.",
      "version": "NIV",
      "reason": "Deepens trust and belief in God's goodness",
      "reflection": "Faith opens our hearts to experience God's miraculous work."
    },
    {
      "reference": "Psalms 78:38",
      "text": "Yet he was merciful; he forgave their iniquities and did not destroy them. Time after time he restrained his anger and did not stir up his full wrath.",
      "version": "NIV",
      "reason": "Teaches mercy and the freedom of forgiveness",
      "reflection": "Forgiveness frees us from bitterness and opens doors to healing."
    },
    {
      "reference": "Psalms 43:5",
      "text": "Why are you downcast, O my soul? Why so disturbed within me? Put your hope in God, for I will yet praise him, my Savior and my God.",
      "version": "NIV",
      "reason": "Offers encouragement and future perspective",
      "reflection": "Our hope is anchored in God's eternal promises and faithfulness."
    },
    {
      "reference": "Psalms 93:1",
      "text": "The LORD reigns, he is robed in majesty; the LORD is robed in majesty and is armed with strength. The world is firmly established; it cannot be moved.",
      "version": "NIV",
      "reason": "Provides power and resilience for life's challenges",
      "reflection": "Divine strength enables us to overcome any obstacle we face."
    },
    {
      "reference": "Psalms 138:7",
      "text": "Though I walk in the midst of trouble, you preserve my life; you stretch out your hand against the anger of my foes, with your right hand you save me.",
      "version": "NIV",
      "reason": "Provides insight and understanding for daily decisions",
      "reflection": "True wisdom comes from seeking God's guidance in all things."
    }
  ]
}