{
  "query": "jesus wept",
  "timestamp": "2025-08-08T23:53:16.069Z",
  "results": [
    {
      "reference": "John 11:35",
      "text": "Jesus wept.",
      "version": "NIV",
      "reason": "This is the exact verse where Jesus shows deep compassion and empathy at the death of Lazarus.",
      "reflection": "Even in His divinity, Jesus shares in our human grief."
    },
    {
      "reference": "Hebrews 4:15",
      "text": "For we do not have a high priest who is unable to empathize with our weaknesses, but we have one who has been tempted in every way, just as we are—yet he did not sin.",
      "version": "NIV",
      "reason": "This verse highlights Jesus' empathy and understanding of human suffering, similar to when He wept.",
      "reflection": "Jesus is intimately familiar with our struggles and pains."
    },
    {
      "reference": "Isaiah 53:3",
      "text": "He was despised and rejected by mankind, a man of suffering, and familiar with pain. Like one from whom people hide their faces he was despised, and we held him in low esteem.",
      "version": "NIV",
      "reason": "This prophecy describes Jesus as a man acquainted with sorrow and grief, connecting to His tears.",
      "reflection": "Jesus fully embraces the depth of human sorrow."
    },
    {
      "reference": "Romans 12:15",
      "text": "Rejoice with those who rejoice; mourn with those who mourn.",
      "version": "NIV",
      "reason": "This verse encourages empathy and sharing in the emotions of others, as Jesus did.",
      "reflection": "We are called to share in the joys and sorrows of others, following Jesus' example."
    },
    {
      "reference": "Psalm 34:18",
      "text": "The Lord is close to the brokenhearted and saves those who are crushed in spirit.",
      "version": "NIV",
      "reason": "This verse reassures us of God's presence in times of sorrow, reflecting Jesus' compassion.",
      "reflection": "In our deepest pain, God draws near and offers comfort."
    }
  ]
}