{
  "query": "What is the rapture?",
  "timestamp": "2025-09-02T21:35:31.663Z",
  "results": [
    {
      "reference": "1 Thessalonians 4:16-17",
      "text": "For the Lord himself will come down from heaven, with a loud command, with the voice of the archangel and with the trumpet call of God, and the dead in Christ will rise first. After that, we who are still alive and are left will be caught up together with them in the clouds to meet the Lord in the air. And so we will be with the Lord forever.",
      "version": "NIV",
      "reason": "Describes the event of believers being caught up to meet the Lord in the air.",
      "reflection": "The rapture is the blessed hope of meeting the Lord and being with Him forever."
    },
    {
      "reference": "1 Corinthians 15:51-52",
      "text": "Listen, I tell you a mystery: We will not all sleep, but we will all be changed— in a flash, in the twinkling of an eye, at the last trumpet. For the trumpet will sound, the dead will be raised imperishable, and we will be changed.",
      "version": "NIV",
      "reason": "Explains the transformation that will occur at the rapture.",
      "reflection": "At the rapture, believers will be transformed in the twinkling of an eye to be imperishable."
    },
    {
      "reference": "Matthew 24:30-31",
      "text": "Then will appear the sign of the Son of Man in heaven. And then all the peoples of the earth will mourn when they see the Son of Man coming on the clouds of heaven, with power and great glory. And he will send his angels with a loud trumpet call, and they will gather his elect from the four winds, from one end of the heavens to the other.",
      "version": "NIV",
      "reason": "Foretells the gathering of believers by angels at the coming of the Son of Man.",
      "reflection": "The rapture will involve the gathering of God's chosen ones from all corners of the earth."
    },
    {
      "reference": "1 Thessalonians 5:2",
      "text": "For you know very well that the day of the Lord will come like a thief in the night.",
      "version": "NIV",
      "reason": "Emphasizes the sudden and unexpected nature of the rapture.",
      "reflection": "Just as a thief comes unexpectedly, so will the day of the Lord and the rapture catch many by surprise."
    },
    {
      "reference": "Revelation 3:10",
      "text": "Since you have kept my command to endure patiently, I will also keep you from the hour of trial that is going to come on the whole world to test the inhabitants of the earth.",
      "version": "NIV",
      "reason": "Speaks of believers being kept from a future time of trial, possibly alluding to the rapture.",
      "reflection": "God's promise to protect believers from the ultimate trial showcases His faithfulness and provision."
    }
  ]
}