{
  "query": "what is love?",
  "timestamp": "2025-08-08T06:45:34.585Z",
  "results": [
    {
      "reference": "1 Corinthians 13:4-7",
      "text": "Love is patient, love is kind. It does not envy, it does not boast, it is not proud. It does not dishonor others, it is not self-seeking, it is not easily angered, it keeps no record of wrongs. Love does not delight in evil but rejoices with the truth. It always protects, always trusts, always hopes, always perseveres.",
      "version": "NIV",
      "reason": "This passage provides a comprehensive description of love's attributes and actions.",
      "reflection": "True love is demonstrated through selfless and enduring actions."
    },
    {
      "reference": "1 John 4:8",
      "text": "Whoever does not love does not know God, because God is love.",
      "version": "NIV",
      "reason": "This verse establishes God as the source and essence of love.",
      "reflection": "Understanding and experiencing love begins with knowing God."
    },
    {
      "reference": "John 15:13",
      "text": "Greater love has no one than this: to lay down one's life for one's friends.",
      "version": "NIV",
      "reason": "This verse highlights the ultimate expression of love through sacrifice.",
      "reflection": "True love involves self-sacrifice for the sake of others."
    },
    {
      "reference": "1 John 4:18",
      "text": "There is no fear in love. But perfect love drives out fear, because fear has to do with punishment. The one who fears is not made perfect in love.",
      "version": "NIV",
      "reason": "This verse emphasizes that genuine love eliminates fear and creates security.",
      "reflection": "Love provides a safe and secure environment, free from fear."
    },
    {
      "reference": "Romans 5:8",
      "text": "But God demonstrates his own love for us in this: While we were still sinners, Christ died for us.",
      "version": "NIV",
      "reason": "This verse illustrates God's love through the sacrificial act of Jesus' death.",
      "reflection": "God's love is unconditional and demonstrated through Christ's sacrifice."
    }
  ]
}